In [13]:
import numpy as np
import pandas as pd

In [11]:
X = np.array([10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40])
Y = np.array([3,6,10,15,24,42,75,90,79,55,36,26,19,13,9,7])
z = np.sum(X*Y)
f_sum = np.sum(Y)
print(z)
print(f_sum)

12806
509

In [20]:
df = pd.DataFrame({'Column_X': X, 'Column_Y': Y})

In [21]:
df

    Column_X  Column_Y
0         10         3
1         12         6
2         14        10
3         16        15
4         18        24
5         20        42
6         22        75
7         24        90
8         26        79
9         28        55
10        30        36
11        32        26
12        34        19
13        36        13
14        38         9
15        40         7

In [22]:
df['XY'] = df['Column_X']*df['Column_Y']

df

    Column_X  Column_Y    XY
0         10         3    30
1         12         6    72
2         14        10   140
3         16        15   240
4         18        24   432
5         20        42   840
6         22        75  1650
7         24        90  2160
8         26        79  2054
9         28        55  1540
10        30        36  1080
11        32        26   832
12        34        19   646
13        36        13   468
14        38         9   342
15        40         7   280

In [23]:
# Create a sample dataframe
df = pd.DataFrame({
    'Class': [10, 10, 20, 20, 30, 30],
    'Frequency': [2, 3, 4, 1, 2, 5]
})

# Calculate the midpoint of each class
df['Midpoint'] = df['Class']

# Calculate the product of frequency and midpoint
df['Product'] = df['Frequency'] * df['Midpoint']

# Calculate the mean
mean = df['Product'].sum() / df['Frequency'].sum()

print(mean)

21.176470588235293

In [24]:
df

   Class  Frequency  Midpoint  Product
0     10          2        10       20
1     10          3        10       30
2     20          4        20       80
3     20          1        20       20
4     30          2        30       60
5     30          5        30      150